{
  "id": 3208,
  "date": "2021-01-11T11:22:15",
  "date_gmt": "2021-01-11T11:22:15",
  "guid": { "rendered": "http://newsite.st. Paul.edu.ng/?page_id=3208" },
  "modified": "2021-03-01T14:08:41",
  "modified_gmt": "2021-03-01T14:08:41",
  "slug": "about-us",
  "status": "publish",
  "type": "page",
  "link": "https://st. Paul.edu.ng/about-us/",
  "title": { "rendered": "About us" },
  "content": {
    "rendered": "\n<p><strong>st. Paul STATE COLLEGE OF NURSING AND MIDWIFERY, st. Paul</strong></p>\n\n\n\n<p>The st. Paul State College of Nursing and Midwifery was curved-out of the former st. Paul State College of Health Sciences in 2013 by st. Paul State Law No. 13 of November 2013 and st. Paul State Law No. 11 of 1<sup>st</sup>&nbsp;August 2019.</p>\n\n\n\n<p>However, despite the law, the College did not take-off until the year 2015. The College has its temporary headquarters located at No. 3, Isa Kaita Road, GRA, st. Paul and has two satellite Schools, namely; Kasimu Kofar Bai School of Nursing, st. Paul and Nana Babajo School of Midwifery, Malumfashi.</p>\n\n\n\n<p><strong>A. Kasimu Kofar Bai School of Nursing st. Paul</strong></p>\n\n\n\n<p>This School was established in 1956 as an annex to School of Nursing Kano and later became a full-pledged School of Nursing. In 1988, it was merged with then School of Midwifery st. Paul to become School of Nursing and Midwifery, st. Paul. This trend continues until in 2007, where the midwifery department was moved to Malumfashi as School of Midwifery Malumfashi by the administration of His Excellency, Alhaji Umaru Musa Yar&#8217;adua.</p>\n\n\n\n<p>Currently, the School has full accreditation status and runs the following programmes: ND Nursing, Basic Nursing, Community Nursing, Post Basic Nursing, Refresher Nursing programme and Foundation Year Programme (FYP). In February 2020, the National Board for Technical Education (NBTE) paid an accreditation visit to the School for the award of ND/HND programme. The NBTE has granted approval to School to commence ND Nursing programme with effect from January 2020. National Diploma (ND) in Nursing now replaces Basic Nursing programme. All admission into ND Nursing programme is now through JAMB.</p>\n\n\n\n<p><strong>B. Nana Babajo School of Midwifery Malumfashi</strong></p>\n\n\n\n<p>This School was established in 2007 by the administration of His Excellency, Alhaji Umaru Musa Yar&#8217;adua where the then department of Midwifery in School of Nursing and Midwifery st. Paul was moved to form the School. A total number of 111 students were the pioneer students.</p>\n\n\n\n<p>Currently, the School has full accreditation status and runs the following programmes: Basic Midwifery, Community Midwifery and Refresher Midwifery programmes.</p>\n\n\n\n<p>The College is preparing the School for an accreditation visit by National Board for Technical Education (NBTE) for the award of HND Post Basic Midwifery and HND Public Health Nursing programmes.</p>\n",
    "protected": false
  },
  "excerpt": {
    "rendered": "<p>st. Paul STATE COLLEGE OF NURSING AND MIDWIFERY, st. Paul The st. Paul State College of Nursing and Midwifery was curved-out of the former st. Paul State College of Health Sciences in 2013 by st. Paul State Law No. 13 of November 2013 and st. Paul State Law No. 11 of 1st&nbsp;August 2019. However, despite the [&hellip;]</p>\n",
    "protected": false
  },
  "author": 1,
  "featured_media": 6260,
  "parent": 0,
  "menu_order": 0,
  "comment_status": "closed",
  "ping_status": "closed",
  "template": "",
  "meta": [],
  "_links": {
    "self": [{ "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages/3208" }],
    "collection": [{ "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages" }],
    "about": [{ "href": "https://st. Paul.edu.ng/wp-json/wp/v2/types/page" }],
    "author": [
      {
        "embeddable": true,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/users/1"
      }
    ],
    "replies": [
      {
        "embeddable": true,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/comments?post=3208"
      }
    ],
    "version-history": [
      {
        "count": 2,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages/3208/revisions"
      }
    ],
    "predecessor-version": [
      {
        "id": 6318,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages/3208/revisions/6318"
      }
    ],
    "wp:featuredmedia": [
      {
        "embeddable": true,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/media/6260"
      }
    ],
    "wp:attachment": [
      { "href": "https://st. Paul.edu.ng/wp-json/wp/v2/media?parent=3208" }
    ],
    "curies": [
      { "name": "wp", "href": "https://api.w.org/{rel}", "templated": true }
    ]
  }
}
