{
  "id": 3210,
  "date": "2021-01-11T11:22:15",
  "date_gmt": "2021-01-11T11:22:15",
  "guid": { "rendered": "http://newsite.st. Paul.edu.ng/?page_id=3210" },
  "modified": "2021-04-05T13:24:57",
  "modified_gmt": "2021-04-05T13:24:57",
  "slug": "programmes-courses",
  "status": "publish",
  "type": "page",
  "link": "https://st. Paul.edu.ng/programmes-courses/",
  "title": { "rendered": "Programmes/Courses" },
  "content": {
    "rendered": "<p>[vc_row][vc_column][vc_custom_heading text=&#8221;Kasimu Kofar Bai School of Nursing st. Paul&#8221;][/vc_column][/vc_row][vc_row][vc_column][vc_toggle title=&#8221;ND/HND Nursing&#8221;]</p>\n<p><strong>Introduction</strong></p>\n<p>The <strong>main objectives </strong>of the movement of Nursing Education into Colleges of Nursing in collaboration with National Board for Technical Education (NBTE) is to ensure that Nursing and Midwifery education in Nigeria, evolve in line with the National Policy on Education and the contemporary system of education in Nigeria. This is in order to give <strong>legal backing </strong>by the Federal Government to Nursing institutions for the award of <strong>ACADEMIC CERTIFIC</strong><strong>ATES</strong> to Nursing graduates.</p>\n<p>The ND/HND Nursing programme has been designed to allow for seamless academic progression of graduates along the already existing system of education in the country. It also takes cognizance of the new scheme of service for Nurses in Nigeria approved by the National Council of Establishment in 2016.</p>\n<p>The <strong>main goal </strong>of the ND/HND Nursing programme is to prepare competent, skilled, polyvalent Nurse practitioners, versatile midwives and professionally knowledgeable public health Nurses who will use problem-solving skills in providing safe, acceptable, effective and affordable quality health services to meet the health needs of individuals, families and communities at all levels of care.</p>\n<p><strong>About ND/HND Nursing Programme</strong></p>\n<p>The ND/HND Nursing is a four-year UNINTERUPTED programme i.e 2 years for ND and 2 years for HND. Students starts with ND Nursing programme which is a non-terminal programme. The ND Nursing graduates with minimum CGPA of 2.5 (Lower Credit) will then proceed for HND Nursing. Indexing shall be at the beginning of first semester of ND II. Students shall participate in Supervised Clinical Work Experience (SCWE) during the programme. The SCWEs would be in two parts of eight weeks each. The first part of SCWE shall be between the end of ND I, while the second part shall be between the end of ND II. Stipend for SCWE shall be paid through Industrial Training Fund (ITF). The SCWE shall be graded on a pass or fail basis. Where a student has satisfied all other requirements of the programme BUT FAILED SCWEs, he/she may only be allowed to repeat another four months SCWEs at his/own expenses.</p>\n<p>Council’s Professional Exam for General Nursing shall be after successful completion of HND 1 Nursing. However, graduates of HND Nursing programme are required to sit for Council’s professional exam in either of the two options of specialization, namely: Midwifery for registration and licensing as Registered Midwife (RM) and Public Health Nursing for registration and licensing as Registered Public Health Nurse (RPHN).</p>\n<p>HND graduates shall proceed for one-year mandatory Supervised Clinical Experience (Attachment) in an approved health facilities or institution and after successful completion of the one-year mandatory supervised clinical attachment, graduates shall be mobilized for a <strong>one year</strong> National Youth Service Corps (NYSC).</p>\n<p><strong>Admission Requirements</strong>The minimum entry requirement for admission into the ND Nursing programme is minimum of 5 credits including English Language, Mathematics, Biology, Chemistry and Physics at not more than two (2) sittings in WAEC, NECO or NABTEB. Combination of WAEC&amp;WAEC, WAEC&amp;NECO or NECO&amp;NECO are accepted but NABTEB must be one sitting. The JAMB subject combinations for ND Nursing are Use of English, Biology, Chemistry, and Physics. Any combination apart from that, will not be considered no matter the JAMB score. Successful candidates that meets the minimum Cut-off marks will be invited for Screening/Interview by the College.</p>\n<p>[/vc_toggle][vc_toggle title=&#8221;Basic Nursing&#8221;]</p>\n<p>BASIC NURSING PROGRAMME</p>\n<p>This is a 3 years, 6 semesters basic nursing programme, approved by the Nursing and Midwifery Council of Nigeria (NMCN) and run at Kasimu Kofar Bai School of Nursing st. Paul. It is designed to train students on practical nursing skills and gives them the knowledge and clinical experience they need to become a Registered Nurse.</p>\n<p>Registered Nurses can work in any Tertiary Healthcare Institutions (e.g National Hospital, Federal Medical Centers etc), Secondary Healthcare Institutions  (e.g General Hospitals) and Primary Healthcare Institutions (Primary Health Care, Comprehensive Health Care) in the world.</p>\n<p>Admission Requirements</p>\n<ul>\n<li>Candidates must possess at least five (5) credits at not more than two (2) sittings including English Language, Mathematics, Biology, Chemistry and Physics in WAEC, NECO and/or NABTEB.</li>\n</ul>\n<ul>\n<li>Qualified candidates will be required to write an Entrance Exam to be conducted by the College.</li>\n</ul>\n<ul>\n<li>Candidates successful at the Entrance Exam will be invited for an interview to be conducted by the College.</li>\n</ul>\n<ul>\n<li>Candidates successful at the interview will be offered provisional admission into Basic General Nursing programme at Kasimu Kofar Bai School of Nursing st. Paul.</li>\n</ul>\n<ul>\n<li>Candidates admitted into the Basic Nursing Programme will undergo intensive training/lecture in Basic Sciences and Nursing Courses for six months. Thereafter an Introductory Examination  for the First Semester will be conducted by the Kasimu Kofar Bai School of Nursing st. Paul.</li>\n</ul>\n<ul>\n<li>Only successful students at the introductory Exam will be Indexed by the Nursing and Midwifery Council of Nigeria and the unsuccessful students will be withdrawn.</li>\n</ul>\n<p>[/vc_toggle][vc_toggle title=&#8221;Community Nursing&#8221;]</p>\n<p><strong>COMMUNITY NURSING</strong></p>\n<p>This is a 2 years, 4 semesters Community Nursing programme, approved by the Nursing and Nursing Council of Nigeria (NMCN). It is designed to train students on practical community nursing skills and gives them the knowledge and clinical experience they need to become a Licensed Community Nurses (LCN) to provide nursing care to individuals whether sick or well and to assist them in activities that would promote health at the community level where they live and work. Licensed Community Nurses (LCN) also provides support, care and advice to patients with medical and surgical conditions; this care includes taking vital signs, monitoring patients, administering medications, taking patient record and providing health education etc AT COMMUNITY LEVEL under the supervision of Registered Nurse or Registered Public Health Nurse. They also offer advice and emotional support to patient and their families as well as follow-up care.</p>\n<p>The programme is run by Kasimu Kofar Bai School of Nursing st. Paul and is meant to spearhead and implement nursing and health care services to the population at the grassroots, as first responders through home care (domiciliary nursing), provision of consumables, first aid care, primary case management, school health services and prompt referral to the appropriate level of care for further management.</p>\n<p>Only male and female indigenes of st. Paul State who are resident in their community are eligible for admission. Students studying Community Nursing will be sponsored and bonded by the st. Paul State Local Government Service Commission and will be required to work at their respective communities after successful graduation.</p>\n<p>Licensed Community Nurses can only work in Primary Healthcare Institutions (Primary Health Care, Comprehensive Health Care). Licensed Community Nurses who wish to further their education to become Registered Nurses shall be admitted for a two-year programme in a School/College of Nursing provided the pre-requisite O-level papers of 5 credits in English Language, Mathematics, Biology, Chemistry and Physics are met.</p>\n<p><strong>Admission Requirements</strong></p>\n<ul>\n<li>Candidates must possess at least four (4) credits at not more than two (2) sittings including English Language, Biology and two science subjects in WAEC, NECO and/or NABTEB. Combination of WAEC/WAEC, NECO/NECO, WAEC/NECO is acceptable. NABTEB cannot be combined with WAEC or NECO or another NABTEB. If candidate will use NABTEB, he/she must have all the required 4 credits in it.</li>\n<li>Qualified candidates will be required to write an Entrance Exam to be conducted by the College.</li>\n<li>Candidates successful at the Entrance Exam will be invited for an interview to be conducted by the College.</li>\n<li>Candidates successful at the interview will be offered provisional admission into Community Nursing programme at Kasimu Kofar Bai School of Nursing st. Paul.</li>\n<li>Candidates admitted into the Community Nursing Programme will undergo intensive training/lecture in Basic Sciences and Nursing Courses for six months. Thereafter an Introductory Examination for the First Semester will be conducted by the Kasimu Kofar School of Nursing st. Paul.</li>\n<li>Only successful students at the Introductory Exam will be indexed by the Nursing and Nursing Council of Nigeria and unsuccessful students will be withdrawn.</li>\n</ul>\n<p>[/vc_toggle][vc_toggle title=&#8221;Post Basic Nursing&#8221;]</p>\n<p><strong>POST BASIC NURSING</strong></p>\n<p>This is an 18 months, 3 semesters programme approved by Nursing and Midwifery Council of Nigeria (NMCN) and run by Kasimu Kofar Bai School of Nursing st. Paul. It is ideal for those who are already Registered Midwives and are looking to start a career in nursing.</p>\n<p>Students will be trained on practical nursing skills and will acquire the knowledge and skills and gain the clinical experience they need to become a Registered Nurse (RN). Registered Nurse (RN) provides support, care and advice to patients with medical and surgical conditions; this care includes taking vital signs, monitoring patients, administering medications, taking patient record and providing health education etc. They also offer advice and emotional support to patient and their families as well as follow-up care.</p>\n<p>Registered Nurses (RN) can work in any Tertiary Healthcare Institutions (e.g National Hospital, Federal Medical Centers etc), Secondary Healthcare Institutions  (e.g General Hospitals) and Primary Healthcare Institutions (Primary Health Care, Comprehensive Health Care) in the world.</p>\n<p><strong>Admission Requirements</strong></p>\n<ul>\n<li>Candidates must possess at least five (5) credits at not more than two (2) sittings including English Language, Mathematics, Biology, Chemistry and Physics in WAEC, NECO and/or NABTEB. Combination of WAEC/WAEC, NECO/NECO, WAEC/NECO is acceptable. NABTEB cannot be combined with WAEC or NECO or another NABTEB. If candidate will use NABTEB, he/she must have all the required 5 credits in it.</li>\n<li>Candidates must be a Registered Midwives with current practicing licence.</li>\n<li>Qualified candidates will be invited for an interview to be conducted by the College.</li>\n<li>Candidates successful at the interview will be offered provisional admission into Post Basic Nursing programme at Kasimu Kofar School of Nursing st. Paul.</li>\n<li>Admitted students will be indexed by the Nursing and Midwifery Council of Nigeria.</li>\n</ul>\n<p>[/vc_toggle][vc_toggle title=&#8221;Refresher Basic Nursing&#8221;]</p>\n<p><strong>REFRESHER BASIC NURSING</strong></p>\n<p>This is a 1 year, 2 semesters refresher nursing programme, approved by the Nursing and Midwifery Council of Nigeria (NMCN) and run by Kasimu Kofar Bai School of Nursing st. Paul. It is designed for students that underwent training on Basic Nursing programme at accredited School of Nursing but failed the Final Qualifying Examination conducted by the Nursing and Midwifery Council of Nigeria (NMCN) after 3 attempts.</p>\n<p>Students will be trained on practical nursing skills and will acquire the knowledge and gain the clinical experience they need to become a Registered Nurse (RN). Registered Nurse (RN) provides support, care and advice to patients with medical and surgical conditions; this care includes taking vital signs, monitoring patients, administering medications, taking patient record and providing health education etc. They also offer advice and emotional support to patient and their families as well as follow-up care.</p>\n<p>Registered Nurses (RN) can work in any Tertiary Healthcare Institutions (e.g National Hospital, Federal Medical Centers etc), Secondary Healthcare Institutions (e.g General Hospitals) and Primary Healthcare Institutions (Primary Health Care, Comprehensive Health Care) in the world.</p>\n<p><strong>Admission Requirements</strong></p>\n<ul>\n<li>Candidates must possess at least five (5) credits at not more than two (2) sittings including English Language, Mathematics, Biology, Chemistry and Physics in WAEC, NECO and/or NABTEB. Combination of WAEC/WAEC, NECO/NECO, WAEC/NECO is acceptable. NABTEB cannot be combined with WAEC or NECO or another NABTEB. If candidate will use NABTEB, he/she must have all the required 5 credits in it.</li>\n<li>Evidence of Elimination at Final Qualifying Examination conducted by the Nursing and Midwifery Council of Nigeria.</li>\n<li>Qualified candidates will be invited for an interview to be conducted by the College.</li>\n<li>Candidates successful at the interview will be offered provisional admission into Refresher Nursing programme at Kasimu Kofar Bai School of Nursing st. Paul.</li>\n<li>Admitted students will be indexed by the Nursing and Midwifery Council of Nigeria.</li>\n</ul>\n<p>[/vc_toggle][vc_toggle title=&#8221;Foundation Year Programme (FYP)&#8221;]</p>\n<p><strong>FOUNDATION YEAR PROGRAMME (FYP)</strong></p>\n<p>This is a remedial programme that was initiated by Women for Health (W4H) organization. The programme is meant to ensure increased number of female health workers. Students will be taught English Language, Mathematics, Biology, Chemistry and Physics and will be prepared and guided for admission into any Health Tertiary Institutions in st. Paul State.</p>\n<p>The programme is now jointly run by the st. Paul State College of Nursing and Midwifery and  st. Paul State Ministry of Local Government and Chieftaincy Affairs under the State Foundation Year Programme Working Group (SFYPWG).</p>\n<p>Only indigenes of st. Paul State are eligible for admission. Secondary School Leavers are usually selected by their various Local Government Areas and are invited for entrance exam. Candidates successful at the Entrance Exam will be invited for an interview. Candidates successful at interview will be offered admission for the FYP remedial.</p>\n<p>Admitted students will be sponsored and bonded by the st. Paul State Local Government and Chieftaincy Affairs. Application forms for any programme in any health institution in st. Paul State will be purchased for them and they will be sponsored if admitted.</p>\n<p>Sponsored FYP Students for any health course in any Health Tertiary Institution will be required to work in their community.</p>\n<div class=\"cleaner\"></div>\n<p>[/vc_toggle][/vc_column][/vc_row][vc_row][vc_column][vc_custom_heading text=&#8221;Nana Babajo School of Midwifery Malumfashi&#8221;][/vc_column][/vc_row][vc_row][vc_column][vc_toggle title=&#8221;Basic Midwifery&#8221;]<strong>BASIC MIDWIFERY</strong></p>\n<p>This is a 3 years, 6 semesters Basic General Midwifery programme, approved by the Nursing and Midwifery Council of Nigeria (NMCN) and run by Nana Babajo School of Midwifery Malumfashi. It is designed to train students on practical midwifery skills and gives them the knowledge and clinical experience they need to become a Registered Midwife (RM). Registered Midwife (RM) provides support, care and advice before, during and after pregnancy, labour and postpartum (after birth) period; this care includes preventative measures, the promotion of normal birth, the detection of complications in mother and child, the accessing of medical care or other appropriate assistance and the carrying out of emergency measures. Registered Midwife (RM) also conducts births and provide care for the newborn and the infant. They also provide family planning and preconception care as well as conduct prenatal exams and order tests.</p>\n<p>Registered Midwives (RM) can work in any Tertiary Healthcare Institutions (e.g National Hospital, Federal Medical Centers etc), Secondary Healthcare Institutions  (e.g General Hospitals), Primary Healthcare Institutions,  (Primary Health Care, Comprehensive Health Care) and Maternal and Child Hospitals in the world.</p>\n<p><strong>Admission Requirements</strong></p>\n<ul>\n<li>Candidates must possess at least five (5) credits at not more than two (2) sittings including English Language, Mathematics, Biology, Chemistry and Physics in WAEC, NECO and/or NABTEB. Combination of WAEC/WAEC, NECO/NECO, WAEC/NECO is acceptable. NABTEB cannot be combined with WAEC or NECO or another NABTEB. If candidate will use NABTEB, she must have all the required 5 credits in it.</li>\n<li>Qualified candidates will be required to write an Entrance Exam to be conducted by the College.</li>\n<li>Candidates successful at the Entrance Exam will be invited for an interview to be conducted by the College.</li>\n<li>Candidates successful at the interview will be offered provisional admission into Basic General Midwifery programme at Nana Babajo School of Midwifery Malumfashi.</li>\n<li> Candidates admitted into the Basic General Midwifery Programme will undergo intensive training/lecture in Basic Sciences, Nursing and Midwifery Courses for six months. Thereafter an Introductory Examination  for the First Semester will be conducted by the Nana Babajo School of Midwifery Malumfashi.</li>\n<li> Only successful students at the Introductory Exam will be Indexed by the Nursing and Midwifery Council of Nigeria and the unsuccessful students will be withdrawn.</li>\n</ul>\n<div class=\"cleaner\"></div>\n<p>[/vc_toggle][vc_toggle title=&#8221;Community Midwifery&#8221;]<strong>COMMUNITY MIDWIFERY</strong></p>\n<p>This is a 2 years, 4 semesters Community Midwifery programme, approved by the Nursing and Midwifery Council of Nigeria (NMCN). It is designed to train students on practical community midwifery skills and gives them the knowledge and clinical experience they need to become a Licensed Community Midwife (LCM). Licensed Community Midwife (LCM) provides support, care and advice before, during and after pregnancy, labour and postpartum (after birth) period AT COMMUNITY LEVEL; this care includes preventative measures, the promotion of normal birth, the detection of complications in mother and child, the accessing of medical care or other appropriate assistance and the carrying out of emergency measures. Licensed Community Midwife (RCM) also conducts births and provide care for the newborn and the infant under the supervision of Registered Midwife or Registered Nurse. They also provide family planning and preconception care as well as conduct prenatal exams and order tests.</p>\n<p>The programme is run by Nana Babajo School of Midwifery Malumfashi and is meant to reduce maternal mortality rate. Only female indigene of st. Paul State and resident in their community are eligible for admission. Students studying Community Midwifery will be sponsored and bonded by the st. Paul State Local Government Service Commission. Upon successful graduation, registered community midwives will be required to work for 2 years at their respective communities.</p>\n<p>Licensed Community Midwives can only work in Primary Healthcare Institutions (Primary Health Care, Comprehensive Health Care). Licensed Community Midwives who wish to further their education to become Registered Midwives shall be admitted for a two-year programme in a School/College of Midwifery provided the pre-requisite O-level papers of 5 credits in English Language, Mathematics, Biology, Chemistry and Physics are met.</p>\n<p><strong>Admission Requirements</strong></p>\n<ul>\n<li>Candidates must possess at least four (4) credits at not more than two (2) sittings including English Language, Biology and two science subjects in WAEC, NECO and/or NABTEB. Combination of WAEC/WAEC, NECO/NECO, WAEC/NECO is acceptable. NABTEB cannot be combined with WAEC or NECO or another NABTEB. If candidate will use NABTEB, he/she must have all the required 4 credits in it.</li>\n<li>Candidate must possess a Letter of Identification of Residence signed and stamped Village Head, Ward Head, District Head and Local Government Chairman</li>\n<li>Qualified candidates will be required to write an Entrance Exam to be conducted by the College. The Entrance Exam usually covers English Language, Biology and Civil Education.</li>\n<li>Candidates successful at the Entrance Exam will be invited for an interview to be conducted by the College.</li>\n<li>Candidates successful at the interview will be offered provisional admission into Community Midwifery programme at Nana Babajo School of Midwifery Malumfashi.</li>\n<li>Candidates admitted into the Community Midwifery Programme will undergo intensive training/lecture in Basic Sciences, Nursing and Midwifery Courses for six months. Thereafter an Introductory Examination for the First Semester will be conducted by the Nana Babajo School of Midwifery Malumfashi.</li>\n<li>Only successful students at the Introductory Exam will be Indexed by the Nursing and Midwifery Council of Nigeria and unsuccessful students will be withdrawn.</li>\n</ul>\n<p><strong>NOTE</strong></p>\n<ul>\n<li>Applicants for <strong>COMMUNITY MIDWIFERY </strong>must possess minimum of 4 credits at not more than two (2) sittings including English Language, Biology and any two of Mathematics, Chemistry and Physics.</li>\n<li>Applicant for Community Midwifery MUST be a female Indigene of st. Paul State and resident of her community in st. Paul State.</li>\n<li>Combination of WAEC/WAEC, NECO/NECO, WAEC/NECO is acceptable. NABTEB cannot be combined with WAEC or NECO or another NABTEB. If candidate will use NABTEB, she must have all the required 4 credits in it.</li>\n</ul>\n<p><a href=\"https://st. Paul.edu.ng/sample_identification_letter.pdf\">DOWNLOAD SAMPLE IDENTIFICATION LETTER OF RESIDENCE FOR COMMUNITY MIDWIFERY APPLICANTS</a>[/vc_toggle][vc_toggle title=&#8221;Refresher Basic Midwifery&#8221;]<strong>REFRESHER BASIC MIDWIFERY</strong></p>\n<p>This is a 1 year, 2 semesters refresher Midwifery programme, approved by the Nursing and Midwifery Council of Nigeria (NMCN) and run by Nana Babajo School of Midwifery Malumfashi. It is designed for students that underwent training on Basic Midwifery programme at accredited School of Midwifery but failed the Final Qualifying Examination conducted by the Nursing and Midwifery Council of Nigeria (NMCN) after 3 attempts.</p>\n<p>Students will be trained on practical Midwifery skills and will gain the clinical experience they need to become a Registered Midwife (RM). Registered Midwife (RM) provides support, care and advice before, during and after pregnancy, labour and postpartum (after birth) period; this care includes preventative measures, the promotion of normal birth, the detection of complications in mother and child, the accessing of medical care or other appropriate assistance and the carrying out of emergency measures. Registered Midwife (RM) also conducts births and provide care for the newborn and the infant. They also provide family planning and preconception care as well as conduct prenatal exams and order tests.</p>\n<p>Registered Midwives can work in any Tertiary Healthcare Institutions (e.g National Hospital, Federal Medical Centers etc), Secondary Healthcare Institutions (e.g General Hospitals), Primary Healthcare Institutions (Primary Health Care, Comprehensive Health Care) and Maternal and Child Hospitals in the world.</p>\n<p><strong>Admission Requirements</strong></p>\n<ul>\n<li>Candidates must possess at least five (5) credits at not more than two (2) sittings including English Language, Mathematics, Biology, Chemistry and Physics in WAEC, NECO and/or NABTEB. Combination of WAEC/WAEC, NECO/NECO, WAEC/NECO is acceptable. NABTEB cannot be combined with WAEC or NECO or another NABTEB. If candidate will use NABTEB, she must have all the required 5 credits in it.</li>\n<li>Evidence of Elimination at the Final Qualifying Examination conducted by the Nursing and Midwifery Council of Nigeria.</li>\n<li>Qualified candidates will be invited for an interview to be conducted by the College.</li>\n<li>Candidates successful at the interview will be offered provisional admission into Refresher Midwifery programme at Nana Babajo School of Midwifery Malumfashi.</li>\n<li>Admitted students will be indexed by the Nursing and Midwifery Council of Nigeria.</li>\n</ul>\n<div class=\"cleaner\"></div>\n<p>[/vc_toggle][/vc_column][/vc_row]</p>\n",
    "protected": false
  },
  "excerpt": {
    "rendered": "<p>[vc_row][vc_column][vc_custom_heading text=&#8221;Kasimu Kofar Bai School of Nursing st. Paul&#8221;][/vc_column][/vc_row][vc_row][vc_column][vc_toggle title=&#8221;ND/HND Nursing&#8221;] Introduction The main objectives of the movement of Nursing Education into Colleges of Nursing in collaboration with National Board for Technical Education (NBTE) is to ensure that Nursing and Midwifery education in Nigeria, evolve in line with the National Policy on Education [&hellip;]</p>\n",
    "protected": false
  },
  "author": 1,
  "featured_media": 0,
  "parent": 0,
  "menu_order": 0,
  "comment_status": "closed",
  "ping_status": "closed",
  "template": "",
  "meta": [],
  "_links": {
    "self": [{ "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages/3210" }],
    "collection": [{ "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages" }],
    "about": [{ "href": "https://st. Paul.edu.ng/wp-json/wp/v2/types/page" }],
    "author": [
      {
        "embeddable": true,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/users/1"
      }
    ],
    "replies": [
      {
        "embeddable": true,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/comments?post=3210"
      }
    ],
    "version-history": [
      {
        "count": 7,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages/3210/revisions"
      }
    ],
    "predecessor-version": [
      {
        "id": 6642,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages/3210/revisions/6642"
      }
    ],
    "wp:attachment": [
      { "href": "https://st. Paul.edu.ng/wp-json/wp/v2/media?parent=3210" }
    ],
    "curies": [
      { "name": "wp", "href": "https://api.w.org/{rel}", "templated": true }
    ]
  }
}
