{
  "id": 6373,
  "date": "2021-03-04T18:33:18",
  "date_gmt": "2021-03-04T18:33:18",
  "guid": { "rendered": "http://newsite.st. Paul.edu.ng/?page_id=6373" },
  "modified": "2021-04-21T09:06:14",
  "modified_gmt": "2021-04-21T09:06:14",
  "slug": "post-basic-nursing",
  "status": "publish",
  "type": "page",
  "link": "https://st. Paul.edu.ng/post-basic-nursing/",
  "title": { "rendered": "Post Basic Nursing" },
  "content": {
    "rendered": "\n<p><strong>POST BASIC NURSING</strong></p>\n\n\n\n<p>This is an 18 months, 3 semesters programme approved by Nursing and Midwifery Council of Nigeria (NMCN) and run by Kasimu Kofar Bai School of Nursing st. Paul. It is ideal for those who are already Registered Midwives and are looking to start a career in nursing.</p>\n\n\n\n<p>Students will be trained on practical nursing skills and will acquire the knowledge and skills and gain the clinical experience they need to become a Registered Nurse (RN). Registered Nurse (RN) provides support, care and advice to patients with medical and surgical conditions; this care includes taking vital signs, monitoring patients, administering medications, taking patient record and providing health education etc. They also offer advice and emotional support to patient and their families as well as follow-up care.</p>\n\n\n\n<p>Registered Nurses (RN) can work in any Tertiary Healthcare Institutions (e.g National Hospital, Federal Medical Centers etc), Secondary Healthcare Institutions&nbsp; (e.g General Hospitals) and Primary Healthcare Institutions (Primary Health Care, Comprehensive Health Care) in the world.</p>\n\n\n\n<p><strong>Admission Requirements</strong></p>\n\n\n\n<ul><li>Candidates must possess at least five (5) credits at not more than two (2) sittings including English Language, Mathematics, Biology, Chemistry and Physics in WAEC, NECO and/or NABTEB.&nbsp;Combination of WAEC/WAEC, NECO/NECO, WAEC/NECO is acceptable. NABTEB cannot be combined with WAEC or NECO or another NABTEB. If candidate will use NABTEB, he/she must have all the required 5 credits in it.</li><li>Candidates must be a Registered Midwives with current practicing licence.</li><li>Qualified candidates will be invited for an interview to be conducted by the College.</li><li>Candidates successful at the interview will be offered provisional admission into Post Basic Nursing programme at Kasimu Kofar School of Nursing st. Paul.</li><li>Admitted students will be indexed by the Nursing and Midwifery Council of Nigeria.</li></ul>\n",
    "protected": false
  },
  "excerpt": {
    "rendered": "<p>POST BASIC NURSING This is an 18 months, 3 semesters programme approved by Nursing and Midwifery Council of Nigeria (NMCN) and run by Kasimu Kofar Bai School of Nursing st. Paul. It is ideal for those who are already Registered Midwives and are looking to start a career in nursing. Students [&hellip;]</p>\n",
    "protected": false
  },
  "author": 1,
  "featured_media": 0,
  "parent": 0,
  "menu_order": 0,
  "comment_status": "closed",
  "ping_status": "closed",
  "template": "",
  "meta": [],
  "_links": {
    "self": [{ "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages/6373" }],
    "collection": [{ "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages" }],
    "about": [{ "href": "https://st. Paul.edu.ng/wp-json/wp/v2/types/page" }],
    "author": [
      {
        "embeddable": true,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/users/1"
      }
    ],
    "replies": [
      {
        "embeddable": true,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/comments?post=6373"
      }
    ],
    "version-history": [
      {
        "count": 2,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages/6373/revisions"
      }
    ],
    "predecessor-version": [
      {
        "id": 6422,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages/6373/revisions/6422"
      }
    ],
    "wp:attachment": [
      { "href": "https://st. Paul.edu.ng/wp-json/wp/v2/media?parent=6373" }
    ],
    "curies": [
      { "name": "wp", "href": "https://api.w.org/{rel}", "templated": true }
    ]
  }
}
