{
  "id": 6389,
  "date": "2021-03-04T18:34:47",
  "date_gmt": "2021-03-04T18:34:47",
  "guid": { "rendered": "http://newsite.st. Paul.edu.ng/?page_id=6389" },
  "modified": "2021-04-05T13:47:13",
  "modified_gmt": "2021-04-05T13:47:13",
  "slug": "refresher-basic-midwifery",
  "status": "publish",
  "type": "page",
  "link": "https://st. Paul.edu.ng/refresher-basic-midwifery/",
  "title": { "rendered": "Refresher Basic Midwifery" },
  "content": {
    "rendered": "\n<p><strong>REFRESHER BASIC MIDWIFERY</strong></p>\n\n\n\n<p>This is a 1 year, 2 semesters refresher Midwifery programme, approved by the Nursing and Midwifery Council of Nigeria (NMCN) and run by Nana Babajo School of Midwifery Malumfashi. It is designed for students that underwent training on Basic Midwifery programme at accredited School of Midwifery but failed the Final Qualifying Examination conducted by the Nursing and Midwifery Council of Nigeria (NMCN) after 3 attempts.</p>\n\n\n\n<p>Students will be trained on practical Midwifery skills and will gain the clinical experience they need to become a Registered Midwife (RM). Registered Midwife (RM) provides support, care and advice before, during and after pregnancy, labour and postpartum (after birth) period; this care includes preventative measures, the promotion of normal birth, the detection of complications in mother and child, the accessing of medical care or other appropriate assistance and the carrying out of emergency measures. Registered Midwife (RM) also conducts births and provide care for the newborn and the infant.&nbsp;They also provide family planning and preconception care as well as conduct prenatal exams and order tests.</p>\n\n\n\n<p>Registered Midwives can work in any Tertiary Healthcare Institutions (e.g National Hospital, Federal Medical Centers etc), Secondary Healthcare Institutions (e.g General Hospitals),&nbsp;Primary Healthcare Institutions (Primary Health Care, Comprehensive Health Care) and Maternal and Child Hospitals in the world.</p>\n\n\n\n<p><strong>Admission Requirements</strong></p>\n\n\n\n<ul><li>Candidates must possess at least five (5) credits at not more than two (2) sittings including English Language, Mathematics, Biology, Chemistry and Physics in WAEC, NECO and/or NABTEB.&nbsp;Combination of WAEC/WAEC, NECO/NECO, WAEC/NECO is acceptable. NABTEB cannot be combined with WAEC or NECO or another NABTEB. If candidate will use NABTEB, she must have all the required 5 credits in it.</li><li>Evidence of Elimination at the Final Qualifying Examination conducted by the Nursing and Midwifery Council of Nigeria.</li><li>Qualified candidates will be invited for an interview to be conducted by the College.</li><li>Candidates successful at the interview will be offered provisional admission into Refresher Midwifery programme at Nana Babajo School of Midwifery Malumfashi.&nbsp;</li><li>Admitted students will be indexed by the Nursing and Midwifery Council of Nigeria.</li></ul>\n",
    "protected": false
  },
  "excerpt": {
    "rendered": "<p>REFRESHER BASIC MIDWIFERY This is a 1 year, 2 semesters refresher Midwifery programme, approved by the Nursing and Midwifery Council of Nigeria (NMCN) and run by Nana Babajo School of Midwifery Malumfashi. It is designed for students that underwent training on Basic Midwifery programme at accredited School of Midwifery but [&hellip;]</p>\n",
    "protected": false
  },
  "author": 1,
  "featured_media": 0,
  "parent": 0,
  "menu_order": 0,
  "comment_status": "closed",
  "ping_status": "closed",
  "template": "",
  "meta": [],
  "_links": {
    "self": [{ "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages/6389" }],
    "collection": [{ "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages" }],
    "about": [{ "href": "https://st. Paul.edu.ng/wp-json/wp/v2/types/page" }],
    "author": [
      {
        "embeddable": true,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/users/1"
      }
    ],
    "replies": [
      {
        "embeddable": true,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/comments?post=6389"
      }
    ],
    "version-history": [
      {
        "count": 2,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages/6389/revisions"
      }
    ],
    "predecessor-version": [
      {
        "id": 6427,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages/6389/revisions/6427"
      }
    ],
    "wp:attachment": [
      { "href": "https://st. Paul.edu.ng/wp-json/wp/v2/media?parent=6389" }
    ],
    "curies": [
      { "name": "wp", "href": "https://api.w.org/{rel}", "templated": true }
    ]
  }
}
