{
  "id": 6431,
  "date": "2021-03-04T20:12:56",
  "date_gmt": "2021-03-04T20:12:56",
  "guid": { "rendered": "http://newsite.st. Paul.edu.ng/?page_id=6431" },
  "modified": "2021-04-23T11:39:00",
  "modified_gmt": "2021-04-23T11:39:00",
  "slug": "programme-comparisons",
  "status": "publish",
  "type": "page",
  "link": "https://st. Paul.edu.ng/programme-comparisons/",
  "title": { "rendered": "Programme Comparisons" },
  "content": {
    "rendered": "<p>[vc_row][vc_column][vc_toggle title=&#8221;DIFFERENCE BETWEEN ND NURSING AND BASIC NURSING&#8221;]</p>\n<ol>\n<li>The major difference between ND Nursing and Basic Nursing programme is that Basic Nursing graduates are not issued any legally backed academic certificate, they are only issued Testimonial by their Institution and professional licence by Nursing of Midwifery Council of Nigeria (NMCN). While ND/HND Nursing graduates will be issued with legally backed academic certificates and professional licences.</li>\n<li>ND Nursing programme is an uninterrupted 4 years programme where students start with ND Nursing and then proceed to HND Nursing while Basic Nursing is 3 years programme.</li>\n<li>Graduates of ND/HND Nursing undergo 1 year internship programme while graduates of Basic Nursing do not undergo.</li>\n<li>Graduates of ND/HND Nursing programme undergo a 1 year NYSC programme while graduates of Basic Nursing do not undergo.</li>\n<li>Graduates of ND/HND Nursing programme will be issued two professional licences namely Registered Nurse (RN) and Registered Midwife ( or Registered Public Health Nurse (RPHN) while graduate of Basic Nursing programme are issued only one professional licence i.e Registered Nurse (RN).</li>\n<li>Graduates of ND/HND Nursing programme can proceed directly to Postgraduate Diploma (PGD) in Nursing but graduates of Basic Nursing programme must first obtain Bachelor Degree in Nursing (BNSc) before they can proceed to Postgraduate Diploma (PGD) in Nursing.</li>\n<li><strong>NOTE:</strong> Basic Nursing programme will soon cease to be run by all Schools of Nursing in Nigeria, as it will be replaced with ND Nursing programme</li>\n</ol>\n<p>[/vc_toggle][vc_toggle title=&#8221;DIFFERENCE BETWEEN BASIC NURSING AND BASIC MIDWIFERY&#8221;]</p>\n<ol>\n<li>Basic NURSING training is basically on helping patients with medical and surgical conditions while Basic MIDWIFERY is basically helping women during pregnancy, labour, and postpaturm (after birth).</li>\n<li>A NURSE can work in many different medical areas/units while a MIDWIFE majorly works only in labor and delivery.</li>\n<li>Basic NURSING programme has a unit of midwifery courses which is not enough to say they can work as midwives just like Basic MIDWIFERY programme also have a unit of nursing courses which is not enough for them to work in a nursing unit.</li>\n<li>Registered Nurses can specialized as Ophthalmic Nurse, Orthopaedic Nurse, Psychiatric Nurse, Public Health Nurse, Dental Nurse, Anaesthetic Nurse, Otorhinolaryngology (ENT) Nurse, Peri-Op Nurse etc while Registered Midwives CANNOT unless they undergo training in Nursing (e.g Post Basic Nursing programme) and are licensed as Registered Nurse.</li>\n<li>In the College, admission for Basic NURSING programme is for both male and female applicants while admission for MIDWIFERY (Basic and Community) programme is ONLY for female applicants.</li>\n<li>A NURSE that wish to become MIDWIFE must enroll into an 18 months Post Basic Midwifery programme and pass the prescribed examination conducted by the Nursing and Midwifery Council of Nigeria (NMCN) and a MIDWIFE that wish to become NURSE must enroll into an 18 months Post Basic Nursing programme and pass the prescribed examination conducted by the Nursing and Midwifery Council of Nigeria (NMCN).</li>\n<li>Both Basic NURSING and Basic MIDWIFERY are 3 years programmes and those that completed any of the programme can gain direct entry admission into University for Bachelor of Nursing Science degree programme.</li>\n</ol>\n<p>[/vc_toggle][vc_toggle title=&#8221;DIFFERENCE BETWEEN BASIC NURSING AND COMMUNITY NURSING&#8221;]</p>\n<ol>\n<li>BASIC Nursing is 3 years programme while COMMUNITY nursing is 2 years programme.</li>\n<li>BASIC Nursing is for both indigenes of st. Paul State and other States in Nigeria while COMMUNITY Nursing is ONLY for indigenes of st. Paul State.</li>\n<li>Entry requirement for BASIC Nursing is at least 5 credits including English Language, Mathematics, Biology, Chemistry and Physics while entry requirements for COMMUNITY is at least 4 Credits including English Language, Biology and any two science subjects.</li>\n<li>Graduates of BASIC Nursing will be licensed by Nursing and Nursing Council of Nigeria as Registered Nurse (RN) while graduates of COMMUNITY Nursing will be licensed by the Nursing and Nursing Council of Nigeria as Licensed Community Nurse (LCM).</li>\n<li>A Registered Nurse can work in any Healthcare institutions (National Hospitals, Federal Medical Centers, Specialist Hospitals, General Hospitals, Primary Healthcare Centres etc) while COMMUNITY Nurses can ONLY work in Primary Healthcare Centres.</li>\n<li>Registered Nurses can gain direct entry admission into University for Bachelor of Nursing degree programme or direct entry admission into an 18-months Post Basic Midwifery programme while  Licensed COMMUNITY Nurses who wish to further their education to become registered nurses shall be admitted for a two-year programme in a School/College of Nursing provided the pre-requisite O-level papers of 5 credits in English Language, Mathematics, Biology, Chemistry and Physics are met.</li>\n</ol>\n<p>[/vc_toggle][vc_toggle title=&#8221;DIFFERENCE BETWEEN BASIC MIDWIFERY AND COMMUNITY MIDWIFERY&#8221;]</p>\n<ol>\n<li>BASIC midwifery is 3 years programme while COMMUNITY midwifery is 2 years programme.</li>\n<li>BASIC midwifery is for both female indigenes of st. Paul State and other States in Nigeria while COMMUNITY Midwifery is ONLY for female indigenes of st. Paul State and they must be resident of their community.</li>\n<li>Entry requirement for BASIC Midwifery is at least 5 credits including English Language, Mathematics, Biology, Chemistry and Physics while entry requirements for COMMUNITY is at least 4 Credits including English Language, Biology and any two science subjects.</li>\n<li>Students of BASIC Midwifery are NOT sponsored during their training and bonded to work for st. Paul State government after graduation but students of COMMUNITY midwifery programme are sponsored during their training and bonded to work for st. Paul State government for 2 years after graduation. </li>\n<li>Graduates of BASIC midwifery will be licensed by Nursing and Midwifery Council of Nigeria as Registered Midwife (RM) while graduates of COMMUNITY midwifery will be licensed by the Nursing and Midwifery Council of Nigeria as Licensed Community Midwife (LCM).</li>\n<li>A Registered Midwife can work in any Healthcare institutions (National Hospitals, Federal Medical Center, Specialist Hospitals, General Hospitals, Primary Healthcare Centres etc) while COMMUNITY Midwives can ONLY work in Primary Healthcare Centres.</li>\n<li>Registered Midwives can gain direct entry admission into University for Bachelor of Nursing degree programme or direct entry admission into an 18 months Post Basic Nursing programme while  Licensed COMMUNITY Midwives, who wish to further their education to become Registered Midwives shall be admitted for a two-year programme in a School/College of Midwifery provided the pre-requisite O-level papers of 5 credits in English Language, Mathematics, Biology, Chemistry and Physics are met.</li>\n</ol>\n<p>[/vc_toggle][vc_toggle title=&#8221;DIFFERENCE BETWEEN BASIC NURSING AND POST BASIC NURSING&#8221;]</p>\n<ol>\n<li>BASIC nursing programme is 3 years while POST BASIC nursing programme is 18 months.</li>\n<li>BASIC nursing programme is for Secondary Schools leavers with at least 5 credits including English Language, Mathematics, Biology, Chemistry and Physics while POST BASIC nursing programme is for registered midwives.</li>\n</ol>\n<p>[/vc_toggle][/vc_column][/vc_row]</p>\n",
    "protected": false
  },
  "excerpt": {
    "rendered": "<p>[vc_row][vc_column][vc_toggle title=&#8221;DIFFERENCE BETWEEN ND NURSING AND BASIC NURSING&#8221;] The major difference between ND Nursing and Basic Nursing programme is that Basic Nursing graduates are not issued any legally backed academic certificate, they are only issued Testimonial by their Institution and professional licence by Nursing of Midwifery Council of Nigeria (NMCN). [&hellip;]</p>\n",
    "protected": false
  },
  "author": 1,
  "featured_media": 0,
  "parent": 0,
  "menu_order": 0,
  "comment_status": "closed",
  "ping_status": "closed",
  "template": "",
  "meta": [],
  "_links": {
    "self": [{ "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages/6431" }],
    "collection": [{ "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages" }],
    "about": [{ "href": "https://st. Paul.edu.ng/wp-json/wp/v2/types/page" }],
    "author": [
      {
        "embeddable": true,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/users/1"
      }
    ],
    "replies": [
      {
        "embeddable": true,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/comments?post=6431"
      }
    ],
    "version-history": [
      {
        "count": 5,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages/6431/revisions"
      }
    ],
    "predecessor-version": [
      {
        "id": 6679,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages/6431/revisions/6679"
      }
    ],
    "wp:attachment": [
      { "href": "https://st. Paul.edu.ng/wp-json/wp/v2/media?parent=6431" }
    ],
    "curies": [
      { "name": "wp", "href": "https://api.w.org/{rel}", "templated": true }
    ]
  }
}
