{
  "id": 6557,
  "date": "2021-03-18T08:45:55",
  "date_gmt": "2021-03-18T08:45:55",
  "guid": { "rendered": "https://st. Paul.edu.ng/?page_id=6557" },
  "modified": "2021-03-18T08:45:57",
  "modified_gmt": "2021-03-18T08:45:57",
  "slug": "achievements",
  "status": "publish",
  "type": "page",
  "link": "https://st. Paul.edu.ng/achievements/",
  "title": { "rendered": "Achievements" },
  "content": {
    "rendered": "\n<ul><li>Upward review of allowance for Casual staff</li><li>Appointment of 2 School Directors</li><li>Inclusion of 2 School Directors into College Management Committee</li><li>Appointment and Inauguration of College Academic Board Committee</li><li>Appointment of Director Academic Planning, Ag. Director Works and Academic Secretary</li><li>Securing of NBTE accreditation for ND Nursing programme</li><li>Inclusion of the College in JAMB Brochure for ND Nursing programme</li><li>Securing of approval for Two (2) Streams for Nursing and Midwifery programmes by Nursing and Midwifery Council of Nigeria (NMCN)</li><li>Introduction of Community Nursing programme</li><li>Retreat for all College Management, Governing Council, Schools Directors and Ministry of Health Officials</li><li>Tripartite Meeting of Governing Council, College Management and the Schools</li><li>Securing of approval from Governing Council for the appointment of Deputy Provost</li><li>Securing of approval from Governing Council for the establishment of Consultancy Service and Public Relation Unit</li><li>Securing of approval from Governing Council for the establishment of Public Relations Unit</li><li>Securing of approval from Governing Council for the conduct of Mock Accreditation</li><li>Securing of approval from Governing Council for the conduct of workshop on measurement and evaluation, research and data analysis using excel and SPSS</li><li>Securing of approval from Governing Council for the conduct of matriculation for newly admitted students.</li><li>Securing of approval from Governing Council for the College Adopted Scheme of Service</li><li>Deployment of online registration portal for printing of admission letter, online registration, payment of all registration fee, course registration, hostel allocation and e-exam card.</li><li>Production of College Gown</li><li>Development of College Year Planner, Scatter-gram, Academic Calendar and organogram.</li><li>Formulation of College’s Vision and Mission</li><li>Securing of approval from Governing Council for the purchase of printers, scanners and photocopiers for the Schools.</li><li>Securing of approval from Governing Council for the educational partnership with Ladoke Akintola University, Ogbomosho, Oyo State for BNSc Nursing Science and postgraduate programmes.</li><li>Provision of 42 No. new Fire Extinguishers and refilling of 40 existing ones in SON st. Paul and SOM Malumfashi.</li></ul>\n",
    "protected": false
  },
  "excerpt": {
    "rendered": "<p>Upward review of allowance for Casual staff Appointment of 2 School Directors Inclusion of 2 School Directors into College Management Committee Appointment and Inauguration of College Academic Board Committee Appointment of Director Academic Planning, Ag. Director Works and Academic Secretary Securing of NBTE accreditation for ND Nursing programme Inclusion of [&hellip;]</p>\n",
    "protected": false
  },
  "author": 1,
  "featured_media": 0,
  "parent": 0,
  "menu_order": 0,
  "comment_status": "closed",
  "ping_status": "closed",
  "template": "",
  "meta": [],
  "_links": {
    "self": [{ "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages/6557" }],
    "collection": [{ "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages" }],
    "about": [{ "href": "https://st. Paul.edu.ng/wp-json/wp/v2/types/page" }],
    "author": [
      {
        "embeddable": true,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/users/1"
      }
    ],
    "replies": [
      {
        "embeddable": true,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/comments?post=6557"
      }
    ],
    "version-history": [
      {
        "count": 1,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages/6557/revisions"
      }
    ],
    "predecessor-version": [
      {
        "id": 6558,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages/6557/revisions/6558"
      }
    ],
    "wp:attachment": [
      { "href": "https://st. Paul.edu.ng/wp-json/wp/v2/media?parent=6557" }
    ],
    "curies": [
      { "name": "wp", "href": "https://api.w.org/{rel}", "templated": true }
    ]
  }
}
