{
  "id": 6603,
  "date": "2021-04-03T06:45:13",
  "date_gmt": "2021-04-03T06:45:13",
  "guid": { "rendered": "https://st. Paul.edu.ng/?page_id=6603" },
  "modified": "2021-06-21T11:36:17",
  "modified_gmt": "2021-06-21T11:36:17",
  "slug": "frequently-asked-questions",
  "status": "publish",
  "type": "page",
  "link": "https://st. Paul.edu.ng/frequently-asked-questions/",
  "title": { "rendered": "Frequently Asked Questions (FAQ)" },
  "content": {
    "rendered": "<p>[vc_row][vc_column][vc_toggle title=&#8221;1. What is all about this ND Nursing?&#8221;]</p>\n<p style=\"font-weight: 400;\">ND Nursing programme was meant to give legal backing by the Federal Government for the award of ACADEMIC CERTIFICATES to Nurses who graduate from Nursing institutions. The ND/HND Nursing programme has been designed to allow for seamless academic progression of graduates along the already existing system of education in the country. It also takes cognizance of the new scheme of service for Nurses in Nigeria approved by the National Council of Establishment in 2016.</p>\n<p style=\"font-weight: 400;\">The ND/HND Nursing is a four-year UNINTERUPTED programme i.e 2 years for ND and 2 years for HND. Students starts with ND Nursing programme which is a non-terminal programme. The ND Nursing graduates with minimum CGPA of 2.5 (Lower Credit) will then proceed for HND Nursing. HND graduates shall proceed for a one-year mandatory Supervised Clinical Experience (Attachment) in an approved health facilities or institution and after the Clinical Experience, then one-year NYSC.</p>\n<p style=\"font-weight: 400;\">Council’s Professional Exam for General Nursing shall be after successful completion of HND 1 Nursing. However, graduates of HND Nursing programme are required to sit for Council’s professional exam in either of the two options of specialization, namely: Midwifery for registration and licensing as Registered Midwife (RM) and Public Health Nursing for registration and licensing as Registered Public Health Nurse (RPHN).</p>\n<p>[/vc_toggle][vc_toggle title=&#8221;2. Why ND Nursing programme?&#8221;]Graduate of Basic Nursing programme are not issued any legally backed academic certificate by their Institution, they are only issued Testimonial by their Institution and professional licence by Nursing of Midwifery Council of Nigeria (NMCN). <span lang=\"EN-GB\">ND Nursing programme was meant to give legal backing </span><span lang=\"EN-GB\">by the Federal Government to Nursing institutions for the award of ACADEMIC CERTIFICATES to Nursing graduate.</span><span lang=\"EN-GB\"> </span><span lang=\"EN-GB\">The ND/HND Nursing programme has been designed to allow for seamless academic progression of graduates along the already existing system of education in the country.</span><span lang=\"EN-GB\"> </span><span lang=\"EN-GB\">It also takes cognizance of the new scheme of service for Nurses in Nigeria approved by the National Council of Establishment in 2016.</span>[/vc_toggle][vc_toggle title=&#8221;3. Will the College still run Basic Nursing programme?&#8221;]</p>\n<p style=\"font-weight: 400;\">No. The College will no longer admit new students for Basic Nursing programme because ND Nursing has replaced it.</p>\n<p>[/vc_toggle][vc_toggle title=&#8221;4. What is the difference between Basic Nursing and ND Nursing programme?&#8221;]</p>\n<p style=\"font-weight: 400;\">Basic Nursing graduates are not issued any legally backed academic certificate, they are only issued Testimonial by their Institution and professional licence by Nursing of Midwifery Council of Nigeria (NMCN). While <span lang=\"EN-GB\">ND/HND Nursing graduates will be issued with legally backed academic certificates and professional licences.</span></p>\n<p>[/vc_toggle][vc_toggle title=&#8221;5. Is HND Nursing equivalent to BNSc Nursing Science?&#8221;]</p>\n<p style=\"font-weight: 400;\">Academically, HND Nursing is not equivalent to BNSc Nursing, as HND Nursing graduates are required to have PGD Nursing before proceeding to MSc Nursing programme while BNSc Nursing can proceed to MSc Nursing without PGD Nursing. However, professionally they may be the same since both HND Nursing and BNSc Nursing graduates usually obtain 2 same professional licences, namely, Registered Nurse (RN) and Registered Midwife (RM) or Registered Public Health Nurse (RPHN) licence.</p>\n<p>[/vc_toggle][vc_toggle title=&#8221;6. What are the SSCE O-Level Requirements for ND Nursing?&#8221;]</p>\n<p style=\"font-weight: 400;\">Candidates must have minimum of 5 credits including English Language, Mathematics, Biology, Chemistry and Physics at not more than two (2) sittings in WAEC, NECO or NABTEB. <span lang=\"EN-GB\">Combination</span><span lang=\"EN-GB\"> of WAEC&amp;WAEC, WAEC&amp;NECO or NECO&amp;NECO are accepted but NABTEB must be one sitting.</span></p>\n<p>[/vc_toggle][vc_toggle title=&#8221;7. What are the JAMB subject combinations?&#8221;]</p>\n<p style=\"font-weight: 400;\">JAMB subject combinations for ND Nursing are Use of English, Biology, Chemistry, and Physics. Any combination apart from the above, will not be considered no matter the JAMB score.</p>\n<p>[/vc_toggle][vc_toggle title=&#8221;8. Can I apply with my 2020 JAMB result?&#8221;]</p>\n<p style=\"font-weight: 400;\">NO. Because our College was not featured in JAMB brochure in the year 2020.</p>\n<p>[/vc_toggle][vc_toggle title=&#8221;10. Will you consider those that choose your College as Second Choice?&#8221;]</p>\n<p style=\"font-weight: 400;\">Candidates can choose our College under ND-Awarding Institutions as First or Second Choice. However, candidates that did not choose our College during JAMB registration and now wish to choose our College, can apply for Change of Institutions through JAMB Portal and choose our College as First or Second choice.</p>\n<p>[/vc_toggle][vc_toggle title=&#8221;11. What is the minimum cutoff marks?&#8221;]</p>\n<p style=\"font-weight: 400;\">Minimum cutoff marks is usually determined after every JAMB exam for each category of institutions during JAMB Policy Meeting on Admission. The minimum cutoff marks for ND Nursing is the same with the national minimum cutoff marks for Polytechnics. However, the College may the decide to increase its cutoff marks.</p>\n<p>[/vc_toggle][vc_toggle title=&#8221;12. After completing ND Nursing, can I leave the School?&#8221;]</p>\n<p style=\"font-weight: 400;\">The ND/HND Nursing is a four-year UNINTERUPTED programme. Students starts with ND Nursing programme which is a non-terminal programme. The ND graduates with minimum <span lang=\"EN-GB\">CGPA of 2.5</span><span lang=\"EN-GB\"> </span>(Lower Credit) will then proceed for HND Nursing.</p>\n<p>[/vc_toggle][vc_toggle title=&#8221;13. Is proceeding from ND to HND automatic?&#8221;]</p>\n<p style=\"font-weight: 400;\"><span lang=\"EN-GB\">YES, only if students earn a minimum CGPA of 2.5 (Lower Credit) and w</span><span lang=\"EN-GB\">here a student scores below a CGPA of 2.5, he/she shall be required to repeat ND II and earn minimum of CGPA 2.5 before proceeding to HND Nursing.</span></p>\n<p>[/vc_toggle][vc_toggle title=&#8221;14. Will there be Students Industrial Work Experience (SIWES)/Industrial Training (IT) during the ND programme?&#8221;]</p>\n<p style=\"font-weight: 400;\">Students shall participate in Supervised Clinical Work Experience (SCWE) while in training. The period of the SCWEs would be in two parts of eight weeks each. The first part of SCWE shall be between the end of ND I, while the second part shall be between the end of ND II. <span lang=\"EN-GB\">Stipend for SCWE shall be paid through Industrial Training Fund (ITF).</span> The SCWE <span lang=\"EN-GB\">shall be graded on a pass or fail basis.  Where a student has satisfied all other requirements of the programme BUT FAILED SCWEs, he/she may only allowed to repeat another four months SCWEs at his/own expenses.</span></p>\n<p>[/vc_toggle][vc_toggle title=&#8221;15. When will students be indexed by the Council?&#8221;]</p>\n<p style=\"font-weight: 400;\"><span lang=\"EN-GB\">Indexing</span><span lang=\"EN-GB\"> shall be at the beginning of first semester of ND II.</span></p>\n<p>[/vc_toggle][vc_toggle title=&#8221;16. When will students sit for Council’s Exam?&#8221;]</p>\n<p style=\"font-weight: 400;\"><span lang=\"EN-GB\">Council’s Professional Exam for General Nursing shall be after successful completion of HND 1 Nursing. However, graduates of HND Nursing programme are required to sit for Council’s professional exam in either of the two options of specialization, namely: Midwifery for registration and licensing as Registered Midwife (RM)</span> and <span lang=\"EN-GB\">Public Health Nursing for registration and licensing as Registered Public Health Nurse (RPHN).</span></p>\n<p>[/vc_toggle][vc_toggle title=&#8221;17. How many Certificates and Licences will I get after completing HND Nursing?&#8221;]</p>\n<p style=\"font-weight: 400;\"><span lang=\"EN-GB\">Graduates of HND Nursing will obtain 2 academic certificates and 2 professional licences. The academic certificates are ND Nursing Certificate</span> and <span lang=\"EN-GB\">HND Nursing Certificate</span>. The professional licences are <span lang=\"EN-GB\">RN Licence</span> and <span lang=\"EN-GB\">RM or RPHN Licence</span></p>\n<p>[/vc_toggle][vc_toggle title=&#8221;18. Will graduates of HND Nursing go for internship?&#8221;]</p>\n<p style=\"font-weight: 400;\">Yes, graduates of HND Nursing programme shall undergo a one-year mandatory Supervised Clinical Attachment in an approved health facility or institution before proceeding to NYSC.</p>\n<p>[/vc_toggle][vc_toggle title=&#8221;19. Will graduates of HND Nursing go for NYSC?&#8221;]</p>\n<p style=\"font-weight: 400;\">Yes, graduate of HND Nursing will be mobilized for NYSC after completing a one-year mandatory Supervised Clinical Attachment in an approved health facility or institution.</p>\n<p>[/vc_toggle][vc_toggle title=&#8221;20. Is the admission for Basic Midwifery, Community Midwifery, Community Nursing and Post Basic Nursing programmes also through JAMB?&#8221;]</p>\n<p style=\"font-weight: 400;\">NO. Only Basic Nursing is though JAMB for now. Sale of application forms, entrance exam and interview for Basic Midwifery, Community Midwifery, Community Nursing and Post Basic programmes will be done entirely by the College.</p>\n<p>[/vc_toggle][vc_toggle title=&#8221;21. I have RN or RM or Post Basic or ND or NCE or CHEW or B.Sc, can I apply for HND Nursing?&#8221;]</p>\n<p style=\"font-weight: 400;\">NO. You cannot apply for HND Nursing. The ND/HND Nursing is a four-year UNINTERUPTED programme i.e 2 years for ND and 2 years for HND. Only students that start with ND Nursing programme which is a non-terminal programme and obtain minimum <span lang=\"EN-GB\">CGPA of 2.5</span> (Lower Credit) will proceed for HND Nursing.</p>\n<p>However, NBTE and NMCN are working on modalities for an abridgement programme for those with RN or RM to have ND/HND Nursing certificate.[/vc_toggle][vc_toggle title=&#8221;22. Can I apply for both ND Nursing and Community Nursing at the same?&#8221;]</p>\n<p style=\"font-weight: 400;\">Yes, since their Exams and Interviews are not in the same day.</p>\n<p>[/vc_toggle][vc_toggle title=&#8221;23. Can I apply for both Basic Midwifery and Community Midwifery at the same?&#8221;]</p>\n<p style=\"font-weight: 400;\">Yes. Since their Exams and Interviews are not in the same day.</p>\n<p>[/vc_toggle][vc_toggle title=&#8221;24. Will there be Entrance Exam by the College, after sitting for JAMB exams?&#8221;]</p>\n<p style=\"font-weight: 400;\">No entrance exam. Only Screening/interview for those that obtain the minimum cut-off marks from JAMB.</p>\n<p>[/vc_toggle][vc_toggle title=&#8221;25. Will there be Introductory (Weeding) Exam during ND Nursing programme?&#8221;]</p>\n<p style=\"font-weight: 400;\">No introductory exam during ND Nursing programme. However, students have must good academic standing to proceed from ND I to ND II. Also, s<span lang=\"EN-GB\">tudents must earn a minimum CGPA of 2.5 (Lower Credit)</span><span lang=\"EN-GB\"> </span>to proceed to HND 1 and w<span lang=\"EN-GB\">here a student scores below a CGPA of 2.5, he/she shall be required to repeat ND II and earn minimum of CGPA 2.5 before proceeding to HND Nursing.</span></p>\n<p>[/vc_toggle][vc_toggle title=&#8221;26. Can candidates that are not from st. Paul State apply?&#8221;]</p>\n<p style=\"font-weight: 400;\">All citizens of Nigeria can apply for ND Nursing, Basic Midwifery, Post Basic Nursing, Refresher Nursing and Refresher Midwifery programmes of the College. Only Community Nursing and Community Midwifery programmes are meant for only indigene of st. Paul State.</p>\n<p>[/vc_toggle][vc_toggle title=&#8221;27. Can a student that is already studying under the College apply for ND Nursing or any other programme of the College?&#8221;]Yes but if admitted, he/she must self-withdraw from the previous programme.[/vc_toggle][vc_toggle title=&#8221;28. Can candidates with physical disability apply?&#8221;]NO. Candidates with upper or lower limbs disability, vision impairment or hearing impairment are not eligible to apply.[/vc_toggle][vc_toggle title=&#8221;29. How much is the cost of registration for JAMB?&#8221;]</p>\n<p style=\"font-weight: 400;\">For the year 2021, cost of registration is N3,500, purchase of mandatory reading texts is N500 and fee for registration at JAMB accredited centres is N700. Total is N4,700</p>\n<p>[/vc_toggle][vc_toggle title=&#8221;30. Where can I register for JAMB?&#8221;]</p>\n<p style=\"font-weight: 400;\">Candidates can only register at JAMB accredited centres nationwide. National Identity Number (NIN) is requirement for JAMB registration. To see list of JAMB accredited centers, visit <a href=\"http://www.jamb.gov.ng/Accreditted_Centres\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https://www.google.com/url?q=http://www.jamb.gov.ng/Accreditted_Centres&amp;source=gmail&amp;ust=1617516516001000&amp;usg=AFQjCNHXFCkxoCpbG0drKpQrCBN04RAxFQ\">www.jamb.gov.ng/Accreditted_<wbr />Centres</a></p>\n<p>[/vc_toggle][vc_toggle title=&#8221;31. Where can I see your College in the JAMB Portal?&#8221;]Search under ND/OND-Awarding Institutions and select &#8220;st. Paul State College of Nursing and Midwifery, st. Paul&#8221;[/vc_toggle][vc_toggle title=&#8221;32. Is the School a government-owned or private?&#8221;]The College and the Schools under it are all Government-owned.[/vc_toggle][/vc_column][/vc_row]</p>\n",
    "protected": false
  },
  "excerpt": {
    "rendered": "<p>[vc_row][vc_column][vc_toggle title=&#8221;1. What is all about this ND Nursing?&#8221;] ND Nursing programme was meant to give legal backing by the Federal Government for the award of ACADEMIC CERTIFICATES to Nurses who graduate from Nursing institutions. The ND/HND Nursing programme has been designed to allow for seamless academic progression of graduates along the [&hellip;]</p>\n",
    "protected": false
  },
  "author": 1,
  "featured_media": 0,
  "parent": 0,
  "menu_order": 0,
  "comment_status": "closed",
  "ping_status": "closed",
  "template": "",
  "meta": [],
  "_links": {
    "self": [{ "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages/6603" }],
    "collection": [{ "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages" }],
    "about": [{ "href": "https://st. Paul.edu.ng/wp-json/wp/v2/types/page" }],
    "author": [
      {
        "embeddable": true,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/users/1"
      }
    ],
    "replies": [
      {
        "embeddable": true,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/comments?post=6603"
      }
    ],
    "version-history": [
      {
        "count": 11,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages/6603/revisions"
      }
    ],
    "predecessor-version": [
      {
        "id": 6656,
        "href": "https://st. Paul.edu.ng/wp-json/wp/v2/pages/6603/revisions/6656"
      }
    ],
    "wp:attachment": [
      { "href": "https://st. Paul.edu.ng/wp-json/wp/v2/media?parent=6603" }
    ],
    "curies": [
      { "name": "wp", "href": "https://api.w.org/{rel}", "templated": true }
    ]
  }
}
